{
    "NAME": "Sắp xếp",
    "list": {
        "bubble": {
            "name": "Sắp xếp nổi bọt",
            "informations": {
                "idea": [
                    "Duyệt qua mảng nhiều lần",
                    "Mỗi lần duyệt, so sánh các cặp phần tử liền kề và hoán đổi chúng nếu cần thiết",
                    "Phần tử lớn nhất nổi lên cuối mảng sau mỗi lần duyệt, tương tự như bong bóng nổi lên mặt nước"
                ],
                "advantage": [
                    "Đơn giản, trực quan, dễ hiểu",
                    "Hiệu quả với mảng nhỏ",
                    "Là một thuật toán sắp xếp ổn định"
                ],
                "disadvantage": "Hiệu suất kém đối với các mảng lớn",
                "application": [
                    "Thường được sử dụng để giảng dạy và minh họa cơ bản về thuật toán sắp xếp",
                    "Sắp xếp dữ liệu nhỏ",
                    "Kiểm tra sự sắp xếp đúng đắn của các thuật toán khác"
                ]
            },
            "comments": {
                "cpp": [
                    "",
                    "",
                    "",
                    "Định nghĩa hàm {bbs}",
                    "Vòng lặp ngoài dùng giúp cho phép lặp qua mảng nhiều lần để đẩy phần tử lớn nhất (sắp xếp tăng dần) hoặc nhỏ nhất (sắp xếp giảm dần) vào vị trí cuối cùng của mảng",
                    "Vòng lặp trong dùng so sánh các cặp phần tử liền kề và hoán đổi nếu chúng không theo thứ tự",
                    "Kiểm tra xem hai phần tử liền kề trong mảng có đang ở sai thứ tự hay không. Nếu điều kiện đúng thì hai phần tử này cần được hoán đổi để đưa phần tử lớn hơn về sau (sắp xếp tăng dần).",
                    "Hoán đổi hai phần tử"
                ],
                "js": [
                    "{{{cpp,3-7}}}"
                ],
                "py": [
                    "Định nghĩa hàm {bb_s}",
                    "{{{cpp,4-7}}}"
                ]
            }
        },
        "selection": {
            "name": "Sắp xếp chọn",
            "informations": {
                "idea": [
                    "Chia mảng thành hai phần: phần đã được sắp xếp và phần chưa được sắp xếp",
                    "Ban đầu, phần đã được sắp xếp là trống và phần chưa được sắp xếp là toàn bộ mảng",
                    "Lặp nhiều lần, với mỗi lần lặp, tìm phần tử nhỏ nhất (hoặc lớn nhất) trong phần chưa sắp xếp, sau đó hoán đổi nó với phần tử đầu tiên trong phần chưa sắp xếp, mở rộng phần đã được sắp xếp"
                ],
                "advantage": [
                    "Đơn giản, trực quan, dễ hiểu",
                    "Hiệu quả với mảng nhỏ"
                ],
                "disadvantage": [
                    "Hiệu suất kém đối với các mảng lớn",
                    "Là một thuật toán sắp xếp không ổn định"
                ],
                "application": [
                    "Sắp xếp dữ liệu nhỏ",
                    "Khi dữ liệu không gian bộ nhớ hạn chế",
                    "Sắp xếp một phần nhỏ của dữ liệu"
                ]
            },
            "comments": {
                "cpp": [
                    "",
                    "",
                    "",
                    "Định nghĩa hàm {slts}",
                    "Vòng lặp ngoài giúp lặp qua mảng nhiều lần để tìm và đặt phần tử nhỏ nhất hoặc lớn nhất của phần mảng chưa được sắp xếp vào vị trí đúng của nó",
                    "Khởi tạo biến {min} dùng để giữ vị trí của phần tử nhỏ nhất trong phần mảng chưa được sắp xếp",
                    "Vòng lặp trong dùng để tìm phần tử nhỏ nhất trong phần mảng chưa được sắp xếp",
                    "Kiểm tra xem phần tử tại vị trí {j} có nhỏ hơn phần tử tại vị trí {min} hay không. Nếu đúng, cập nhật {min} để giữ vị trí của phần tử nhỏ nhất hiện tại.",
                    "Hoán đổi hai phần tử"
                ],
                "js": [
                    "{{{cpp,3-8}}}"
                ],
                "py": [
                    "Định nghĩa hàm {slt_s}",
                    "{{{cpp,4-7}}}",
                    "Cập nhật {min}",
                    "{{{cpp,8}}}"
                ]
            }
        },
        "insertion": {
            "name": "Sắp xếp chèn",
            "informations": {
                "idea": [
                    "Chia mảng thành hai phần: phần đã được sắp xếp và phần chưa được sắp xếp",
                    "Ban đầu, phần đã được sắp xếp chỉ chứa phần tử đầu tiên, phần còn lại của mảng là phần chưa được sắp xếp",
                    "Lặp lại quá trình lấy phần tử tiếp theo từ phần chưa được sắp xếp và chèn nó vào vị trí đúng trong phần đã được sắp xếp"
                ],
                "advantage": [
                    "Đơn giản, trực quan, dễ hiểu",
                    "Hiệu quả với mảng nhỏ",
                    "Hoạt động tốt với mảng gần như đã được sắp xếp",
                    "Là một thuật toán sắp xếp ổn định"
                ],
                "disadvantage": "Hiệu suất kém đối với các mảng lớn",
                "application": [
                    "Sắp xếp dữ liệu nhỏ hoặc gần như đã sắp xếp",
                    "Sắp xếp dữ liệu trong các ứng dụng desktop và di động",
                    "Thuật toán trung gian trong các thuật toán phức tạp hơn"
                ]
            },
            "comments": {
                "cpp": [
                    "",
                    "",
                    "",
                    "Định nghĩa hàm {ists}",
                    "Vòng lặp ngoài để duyệt qua các vị trí của mảng. Phần tử đầu tiên được xem là đã sắp xếp.",
                    "Khởi tạo {j} để duyệt ngược lại các phần tử đã sắp xếp",
                    "Khởi tạo {current} để lưu giữ giá trị của phần tử hiện đang cần tìm vị trí",
                    "Vòng lặp trong dùng để duyệt từ phải sang trái, tìm vị trí đúng để chèn phần tử {current} vào trong phần đã được sắp xếp của mảng. So sánh để kiểm tra phần tử tại vị trí {j} có lớn hơn {current} hay không, nếu đúng thì dịch chuyển phần tử tại {j} sang phải để tạo khoảng trống cho {current}.",
                    "Dịch chuyển phần tử tại vị trí {j} sang phải",
                    "Chèn {current} vào vị trí đúng"
                ],
                "js": [
                    "{{{cpp,3-9}}}"
                ],
                "py": [
                    "Định nghĩa hàm {ist_s}",
                    "{{{cpp,4}}}",
                    "Khởi tạo {j} để duyệt ngược lại các phần tử đã sắp xếp. Khởi tạo {current} để lưu giữ giá trị của phần tử hiện đang cần tìm vị trí.",
                    "{{{cpp,7-8}}}",
                    "Giảm {j} để tiếp tục duyệt sang trái",
                    "{{{cpp,9}}}"
                ]
            }
        },
        "quick": {
            "name": "Sắp xếp nhanh",
            "informations": {
                "idea": [
                    "Chọn một phần tử từ mảng làm điểm chốt",
                    "Phân chia mảng thành hai phần: phần chứa các phần tử nhỏ hơn hoặc bằng điểm chốt và phần chứa các phần tử lớn hơn hoặc bằng điểm chốt",
                    "Đệ quy cho hai phần mảng con",
                    "Các mảng con đã được sắp xếp và gộp lại với nhau sẽ tạo thành mảng đã sắp xếp hoàn chỉnh"
                ],
                "advantage": "Hiệu suất tốt, kể cả với mảng lớn",
                "disadvantage": "Là một thuật toán sắp xếp không ổn định",
                "application": [
                    "Sắp xếp dữ liệu trong ngôn ngữ lập trình và thư viện",
                    "Sắp xếp cơ sở dữ liệu",
                    "Sử dụng trong ứng dụng web và di động",
                    "Xử lý dữ liệu trong các thuật toán phân tán",
                    "Phân tích và chế biến dữ liệu lớn"
                ]
            },
            "comments": {
                "cpp": [
                    "",
                    "",
                    "",
                    "Định nghĩa hàm {qs}",
                    "Nếu {left} lớn hơn hoặc bằng {right}, nghĩa là đoạn mảng cần sắp xếp chỉ có một phần tử hoặc không còn phần tử nào để sắp xếp, hàm sẽ dừng lại và không thực hiện gì thêm",
                    "Khởi tạo {pivot} để lưu giá trị điểm chốt là phần tử ở giữa của đoạn mảng. Phần tử này sẽ được dùng để chia đoạn mảng thành hai phần.",
                    "Khởi tạo {i} để duyệt từ đầu đến giữa đoạn mảng, tìm các phần tử có giá trị lớn hơn hoặc bằng {pivot}",
                    "Khởi tạo {j} để duyệt từ cuối đến giữa đoạn mảng, tìm các phần tử có giá trị nhỏ hơn hoặc bằng {pivot}",
                    "Đảm bảo {i} không vượt quá {j} trong quá trình tìm và hoán đổi các phần tử",
                    "Tăng {i} cho đến khi tìm thấy phần tử lớn hơn hoặc bằng {pivot}",
                    "Giảm {j} cho đến khi tìm thấy phần tử nhỏ hơn hoặc bằng {pivot}",
                    "Kiểm tra lại xem {i} có vượt quá {j} hay không",
                    "Hoán đổi hai phần tử để bên trái là các phần tử nhỏ hơn hoặc bằng {pivot}, bên phải là các phần tử lớn hơn hoặc bằng {pivot}. Tăng {i} và giảm {j} cho lần tìm tiếp theo.",
                    "",
                    "Tiếp tục sắp xếp đoạn mảng từ {left} đến {j}",
                    "Tiếp tục sắp xếp đoạn mảng từ {i} đến {right}"
                ],
                "js": [
                    "{{{cpp,3-4}}}",
                    "Khởi tạo {jspivot} để lưu giá trị điểm chốt là phần tử ở giữa của đoạn mảng. Phần tử này sẽ được dùng để chia đoạn mảng thành hai phần.",
                    "Khởi tạo {i} để duyệt từ đầu đến giữa đoạn mảng, tìm các phần tử có giá trị lớn hơn hoặc bằng {jspivot}",
                    "Khởi tạo {j} để duyệt từ cuối đến giữa đoạn mảng, tìm các phần tử có giá trị nhỏ hơn hoặc bằng {jspivot}",
                    "{{{cpp,8}}}",
                    "Tăng {i} cho đến khi tìm thấy phần tử lớn hơn hoặc bằng {jspivot}",
                    "Giảm {j} cho đến khi tìm thấy phần tử nhỏ hơn hoặc bằng {jspivot}",
                    "{{{cpp,11}}}",
                    "Hoán đổi hai phần tử để bên trái là các phần tử nhỏ hơn hoặc bằng {jspivot}, bên phải là các phần tử lớn hơn hoặc bằng {jspivot}",
                    "Tăng {i} cho lần tìm tiếp theo",
                    "Giảm {j} cho lần tìm tiếp theo",
                    "",
                    "",
                    "Tiếp tục sắp xếp đoạn mảng từ {left} đến {j}",
                    "Tiếp tục sắp xếp đoạn mảng từ {i} đến {right}"
                ],
                "py": [
                    "Định nghĩa hàm {q_s}",
                    "{{{cpp,4}}}",
                    "Thoát khỏi hàm",
                    "{{{cpp,5}}}",
                    "Khởi tạo {i} để duyệt từ đầu đến giữa đoạn mảng, tìm các phần tử có giá trị lớn hơn hoặc bằng {pivot}. Khởi tạo {j} để duyệt từ cuối đến giữa đoạn mảng, tìm các phần tử có giá trị nhỏ hơn hoặc bằng {pivot}.",
                    "{{{cpp,8}}}",
                    "Khi {i} chưa tìm thấy phần tử lớn hơn hoặc bằng {pivot}",
                    "Tăng {i}",
                    "Khi {j} chưa tìm thấy phần tử nhỏ hơn hoặc bằng {pivot}",
                    "Giảm {j}",
                    "{{{cpp,11}}}",
                    "Hoán đổi hai phần tử để bên trái là các phần tử nhỏ hơn hoặc bằng {pivot}, bên phải là các phần tử lớn hơn hoặc bằng {pivot}",
                    "{{{js,10-11}}}",
                    "{{{cpp,14-15}}}"
                ]
            }
        },
        "merge": {
            "name": "Sắp xếp trộn",
            "informations": {
                "idea": [
                    "Mảng được chia thành các phần nhỏ hơn, cho đến khi mỗi phần tử được coi là một mảng con",
                    "Mỗi mảng con được sắp xếp bằng cách sử dụng đệ quy",
                    "Các mảng con đã sắp xếp được gộp lại thành một mảng lớn hơn theo thứ tự",
                    "Lặp lại quá trình cho đến khi mảng ban đầu được sắp xếp hoàn toàn"
                ],
                "advantage": [
                    "Hiệu suất tốt, kể cả với mảng lớn",
                    "Là một thuật toán sắp xếp ổn định"
                ],
                "disadvantage": [
                    "Không phải là thuật toán tốt nhất cho các mảng nhỏ"
                ],
                "application": [
                    "Sắp xếp dữ liệu trong cơ sở dữ liệu",
                    "Sắp xếp danh sách trong ứng dụng web",
                    "Sắp xếp tập tin",
                    "Sắp xếp dữ liệu trong ứng dụng desktop hoặc di động",
                    "Sắp xếp dữ liệu trong các thuật toán khác"
                ]
            },
            "comments": {
                "cpp": [
                    "",
                    "",
                    "",
                    "Định nghĩa hàm {merge} dùng để hợp nhất hai mảng con đã được sắp xếp thành một mảng con lớn đã sắp xếp",
                    "Tính kích thước của mảng con trái",
                    "Tính kích thước của mảng con phải",
                    "Tạo một {vector} tạm để lưu mảng con trái",
                    "Tạo một {vector} tạm để lưu mảng con phải",
                    "Sao chép các phần tử từ mảng gốc vào mảng con trái",
                    "Sao chép các phần tử từ mảng gốc vào mảng con phải",
                    "Khởi tạo {i} và {j} để duyệt cho mảng con trái và mảng con phải",
                    "Khởi tạo {k} để duyệt cho mảng gốc",
                    "Trộn đồng thời từ cả hai mảng con đến khi một trong hai mảng hết phần tử",
                    "Nếu phần tử hiện tại của mảng con bên trái nhỏ hơn hoặc bằng phần tử hiện tại của mảng con bên phải, đẩy phần tử đó vào mảng gốc và tăng chỉ số cho hai mảng",
                    "Ngược lại, đẩy phần tử hiện tại của mảng con bên phải vào mảng gốc và tăng chỉ số cho hai mảng",
                    "Sao chép các phần tử còn lại của mảng con bên trái vào mảng gốc",
                    "Sao chép các phần tử còn lại của mảng con bên phải vào mảng gốc",
                    "",
                    "",
                    "Định nghĩa hàm {ms}",
                    "Nếu {left} lớn hơn hoặc bằng {right}, nghĩa là đoạn mảng cần sắp xếp chỉ có một phần tử hoặc không còn phần tử nào để sắp xếp, hàm sẽ dừng lại và không thực hiện gì thêm",
                    "Tìm chỉ số giữa của mảng",
                    "Gọi đệ quy để sắp xếp mảng con bên trái từ {left} đến {middle}",
                    "Gọi đệ quy để sắp xếp mảng con bên phải từ {middleplus1} đến {right}",
                    "Gọi hàm {merge} để trộn hai mảng con đã sắp xếp thành một mảng có thứ tự"
                ],
                "js": [
                    "{{{cpp,3-5}}}",
                    "Tạo mảng con bên trái từ mảng gốc",
                    "Tạo mảng con bên phải từ mảng gốc",
                    "{{{cpp,10-21}}}",
                    "Gọi đệ quy để sắp xếp mảng con bên trái từ {left} đến {middlejs}",
                    "Gọi đệ quy để sắp xếp mảng con bên phải từ {middleplus1js} đến {right}",
                    "{{{cpp,24}}}"
                ],
                "py": [
                    "{{{cpp,3-5}}}",
                    "{{{js,3-4}}}",
                    "{{{cpp,10-12}}}",
                    "Kiểm tra xem phần tử hiện tại của mảng con bên trái có nhỏ hơn hoặc bằng phần tử hiện tại của mảng con bên phải hay không. Nếu đúng, đẩy phần tử đó vào mảng gốc.",
                    "Đẩy phần tử hiện tại của mảng con bên trái vào mảng gốc",
                    "Tăng {i} cho lần duyệt tiếp theo",
                    "Ngược lại",
                    "Đẩy phần tử hiện tại của mảng con bên phải vào mảng gốc",
                    "Tăng {j} cho lần duyệt tiếp theo",
                    "Tăng {k} cho lần duyệt tiếp theo",
                    "Duyệt qua các phần tử còn lại của mảng con bên trái",
                    "Thêm phần tử còn lại vào mảng gốc",
                    "{{{py,10}}}",
                    "{{{py,14}}}",
                    "Duyệt qua các phần tử còn lại của mảng con bên phải",
                    "{{{py,16}}}",
                    "{{{py,13-14}}}",
                    "",
                    "Định nghĩa hàm {m_s}",
                    "{{{cpp,20-24}}}"
                ]
            }
        }
    },
    "constraints": {
        "default": [
            "Các giá trị cách nhau bởi khoảng trắng",
            "Giá trị là một số nguyên nằm trong đoạn từ -9 đến 99",
            "Có tối thiểu 7 giá trị"
        ]
    }
}