{
    "bfs": {
        "name": "Breadth-First Search (BFS)",
        "informations": {
            "description": "Thuật toán {{Breadth-First Search (BFS)}} là một thuật toán tìm kiếm trên đồ thị hoặc ma trận bằng cách khám phá các điểm theo chiều rộng từ một điểm bắt đầu. Nó xuất phát bằng việc đưa điểm bắt đầu vào hàng đợi và đánh dấu đã ghé thăm. Sau đó, nó lặp lại việc lấy một điểm từ đầu hàng đợi, kiểm tra tất cả các điểm kề chưa được ghé thăm của nó, thêm chúng vào hàng đợi và đánh dấu đã ghé thăm. Quá trình này tiếp tục cho đến khi hàng đợi trống. BFS đảm bảo tìm kiếm theo chiều rộng, kiểm tra tất cả các điểm cùng cấp trước khi đến cấp tiếp theo.",
            "advantage": [
                "Đảm bảo tìm được đường đi ngắn nhất.",
                "Đơn giản và dễ triển khai.",
                "Khám phá toàn diện đồ thị, ma trận."
            ],
            "disadvantage": [
                "Yêu cầu bộ nhớ lớn.",
                "Không hiệu quả cho đồ thị, ma trận lớn.",
                "Không tối ưu cho đồ thị, ma trận có trọng số.",
                "Khó khăn khi làm việc với đồ thị, ma trận vô hạn."
            ],
            "application": [
                "Tìm đường đi ngắn nhất trong đồ thị không có trọng số.",
                "Tìm kiếm trong trò chơi và thuật toán AI.",
                "Kiểm tra tính kết nối của đồ thị.",
                "Tìm kiếm trong cây (Tree Search).",
                "Phân loại đồ thị.",
                "Tạo ra các hệ thống GPS và tìm kiếm đường đi.",
                "Kiểm tra chu trình trong đồ thị."
            ]
        },
        "comments": {
            "cpp": [
                "",
                "",
                "",
                "Khai báo hàm {bfs}.",
                "Lấy số lượng hàng của ma trận.",
                "Lấy số lượng cột của ma trận.",
                "Khởi tạo ma trận để đánh dấu các điểm đã được thăm.",
                "Khởi tạo ma trận để lưu trữ thông tin về điểm trước đó trong đường đi.",
                "Khởi tạo hàng đợi để lưu trữ các điểm cần thăm.",
                "Đưa điểm bắt đầu vào hàng đợi.",
                "Đánh dấu điểm bắt đầu đã được thăm.",
                "Định nghĩa các hướng di chuyển (lên, xuống, trái, phải).",
                "Khi mà hàng đợi vẫn còn điểm cần duyệt.",
                "Lấy điểm hiện tại (đầu tiên) từ hàng đợi.",
                "Loại bỏ điểm hiện tại khỏi hàng đợi.",
                "Lấy tọa độ {x} của điểm hiện tại.",
                "Lấy tọa độ {y} của điểm hiện tại.",
                "Kiểm tra xem điểm hiện tại có phải là điểm kết thúc hay không. Nếu đúng, tái tạo đường đi và trả về.",
                "Khởi tạo {vector} để lưu đường đi.",
                "Tái tạo đường đi từ điểm đích về điểm bắt đầu.",
                "Thêm điểm hiện tại vào đường đi.",
                "Đảo ngược đường đi để có thứ tự đúng.",
                "Trả về đường đi.",
                "",
                "Nếu chưa đến điểm đích, duyệt qua các hướng di chuyển.",
                "Tính tọa độ {x} mới.",
                "Tính tọa độ {y} mới.",
                "Kiểm tra xem tọa độ mới có hợp lệ và chưa được đến thăm hay không. Nếu thỏa mãn, cập nhật trạng thái và thông tin của điểm đó.",
                "Đưa điểm mới vào hàng đợi.",
                "Đánh dấu điểm mới đã được thăm.",
                "Lưu điểm hiện tại là điểm trước đó của điểm mới.",
                "",
                "",
                "",
                "Trả về mảng rỗng nếu không tìm thấy đường đi."
            ],
            "js": [
                "{{{cpp,3}}}",
                "{{{cpp,4}}}",
                "{{{cpp,5}}}",
                "{{{cpp,6}}}",
                "{{{cpp,7}}}",
                "Khởi tạo hàng đợi để lưu trữ các điểm cần thăm. Đưa điểm bắt đầu vào hàng đợi.",
                "{{{cpp,10}}}",
                "{{{cpp,11}}}",
                "{{{cpp,12}}}",
                "Lấy tọa độ điểm hiện tại (đầu tiên) ra khỏi hàng đợi.",
                "{{{cpp,17}}}",
                "Khởi tạo mảng để lưu đường đi.",
                "{{{cpp,19}}}",
                "{{{cpp,20}}}",
                "Trả về đường đi sau khi đã đảo ngược thứ tự.",
                "",
                "{{{cpp,24}}}",
                "Tính tọa độ {xjs} mới.",
                "Tính tọa độ {yjs} mới.",
                "{{{cpp,27}}}",
                "{{{cpp,28}}}",
                "{{{cpp,29}}}",
                "{{{cpp,30}}}",
                "",
                "",
                "",
                "{{{cpp,34}}}"
            ]
        }
    },
    "_": {
        "constraints": []
    }
}